; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v8 - type_2 ?v3 - type_1)
 	      (pred_1 ?v7 - object ?v3 - type_1)
	      (pred_2 ?v8 - type_2 ?v1 - type_3)
	      (pred_4 ?v8 - type_2 ?v7 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v8 - type_2 ?v4 ?v5 - type_1)
       :precondition (and  (pred_3 ?v8 ?v4))
       :effect (and  (pred_3 ?v8 ?v5)
		     (not (pred_3 ?v8 ?v4))))

   (:action op_3
       :parameters (?v8 - type_2 ?v6 - object ?v2 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v2) (pred_3 ?v8 ?v2) (pred_2 ?v8 ?v1))
       :effect (and (pred_4 ?v8 ?v6 ?v1)
		    (not (pred_1 ?v6 ?v2)) 
		    (not (pred_2 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_2 ?v6 - object ?v2 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v6 ?v1) (pred_3 ?v8 ?v2))
       :effect (and (pred_1 ?v6 ?v2)
		    (pred_2 ?v8 ?v1)
		    (not (pred_4 ?v8 ?v6 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_2
obj_03 obj_09 - type_3
obj_04 obj_06 obj_07 obj_01 - type_1
obj_05 obj_10 obj_02 - object)
(:init
(pred_3 obj_08 obj_01)
(pred_2 obj_08 obj_03)
(pred_2 obj_08 obj_09)
(pred_1 obj_05 obj_07)
(pred_1 obj_10 obj_07)
(pred_1 obj_02 obj_07)
)
(:goal
(and
(pred_1 obj_05 obj_04)
(pred_1 obj_10 obj_07)
(pred_1 obj_02 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_08 ?b obj_09))))
)
)

; plan
1. (op_2 obj_08 obj_01 obj_07)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_07)
   goals met: 2 of 3
2. (op_3 obj_08 obj_05 obj_07 obj_03)
   deleted: (pred_1 obj_05 obj_07) (pred_2 obj_08 obj_03)
   added: (pred_4 obj_08 obj_05 obj_03)
   goals met: 2 of 3
3. (op_2 obj_08 obj_07 obj_04)
   deleted: (pred_3 obj_08 obj_07)
   added: (pred_3 obj_08 obj_04)
   goals met: 2 of 3
4. (op_1 obj_08 obj_05 obj_04 obj_03)
   deleted: (pred_4 obj_08 obj_05 obj_03)
   added: (pred_1 obj_05 obj_04) (pred_2 obj_08 obj_03)
   goals met: 3 of 3
